{
  "symbol":"zec",
  "name":"ZCash",
  "info":"<p>Zcash is a cryptocurrency aimed at using cryptography to provide enhanced privacy for its users compared to other cryptocurrencies such as Bitcoin.</p>  <p>Like Bitcoin, Zcash has a fixed total supply of 21 million units.</p>  <p>Transactions can be &quot;transparent&quot; and similar to bitcoin transactions in which case they are controlled by a t-addr, or can be a type of zero-knowledge proof called zk-SNARKs; the transactions are then said to be &quot;shielded&quot; and are controlled by a z-addr. Zcash coins are either in a transparent pool or a shielded pool; as of December 2017 only around 4% of Zcash coins were in the shielded pool and at that time most wallet programs did not support z-addrs and no web-based wallets supported them.</p>  <p>Zcash affords private transactors the option of &quot;selective disclosure&quot;, allowing a user to prove payment for auditing purposes. One such reason is to allow private transactors the choice to comply with anti-money laundering or tax regulations. &quot;Transactions are auditable but disclosure is under the participant's control.&quot; The company has hosted virtual meetings with law enforcement agencies around the U.S. to explain these fundamentals and has gone on the record of saying that &quot;they did not develop the currency to facilitate illegal activity&quot;.</p><a href=\"https://en.wikipedia.org/wiki/Zcash\">https://en.wikipedia.org/wiki/Zcash</a>",
  "module":"quartz",
  "import":"insight",
  "addressRegex": "^t[13][a-km-zA-HJ-NP-Z1-9]{33}$",
  "mode":"zcash.livenet",
  "factor":8,
  "confirmed":24,
  "fee":0.00001,
  "host": "https://explorer.zecmate.com/api",
  "host_electrum_OLD":["tcp://electrum3.cipig.net:10058","tcp://electrum2.cipig.net:10058","tcp://electrum1.cipig.net:10058"],
  "host_old": "https://zcash.plutomonkey.com/api",
  "cache":15000,
  "throttle":5,
  "trimAddrHexL":"4",
  "quartz":{
    "sample" : [
      "done {address:'t1KvZrdebWzQjtfJMhuGMVzhTG9VpBXzVf3',transaction:'cdea6a548efa88b30fbd110472a1ea4c0e5dee4cc768141dcb09a8c0f9ba4211'}"
    ],
    "test" :[
      "done {hash:'5DDB7F0C'}"
    ]
  }
}
